raw/thread_scalability/sysbench-wt-ext4-wt0-uniform-1200-oltp.txt
sysbench 0.9:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 1200
Report intermediate results every 10 second(s)
Initializing random number generator from current time


setting write concern to 1
Threads started!

FATAL: error in distinct range (No suitable servers found (`serverselectiontryonce` set): [connection timeout calling ismaster on 'smblade04:27017'])
(last message repeated 91 times)
FATAL: error in index update (No suitable servers found (`serverselectiontryonce` set): [connection timeout calling ismaster on 'smblade04:27017'])
(last message repeated 91 times)
FATAL: error in non index update (No suitable servers found (`serverselectiontryonce` set): [connection timeout calling ismaster on 'smblade04:27017'])
(last message repeated 91 times)
FATAL: error in insert (No suitable servers found (`serverselectiontryonce` set): [connection timeout calling ismaster on 'smblade04:27017'])
[  10s] threads: 1200, tps: 8263.10, reads: 34074.90, writes: 24811.31, response time: 255.38ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 1200, tps: 7813.83, reads: 32131.22, writes: 23438.69, response time: 287.69ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 1200, tps: 7798.40, reads: 32030.49, writes: 23396.40, response time: 287.86ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 1200, tps: 7800.40, reads: 32016.70, writes: 23400.49, response time: 288.03ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 1200, tps: 7818.84, reads: 32116.14, writes: 23458.41, response time: 286.74ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 1200, tps: 7815.25, reads: 32056.69, writes: 23444.14, response time: 287.00ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 1200, tps: 7823.12, reads: 32125.05, writes: 23471.65, response time: 286.32ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 1200, tps: 7830.99, reads: 32139.55, writes: 23494.26, response time: 286.40ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 1200, tps: 7855.53, reads: 32267.52, writes: 23563.20, response time: 286.06ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 1200, tps: 7888.67, reads: 32456.79, writes: 23668.41, response time: 284.18ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 1200, tps: 7898.21, reads: 32398.24, writes: 23696.94, response time: 284.10ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 1200, tps: 7841.59, reads: 32139.25, writes: 23521.86, response time: 283.84ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 1200, tps: 7188.64, reads: 29561.63, writes: 21567.61, response time: 311.16ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 1200, tps: 7138.46, reads: 29339.46, writes: 21412.39, response time: 312.19ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 1200, tps: 7155.62, reads: 29369.88, writes: 21464.67, response time: 316.33ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 1200, tps: 7465.70, reads: 30605.90, writes: 22397.39, response time: 300.00ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 1200, tps: 7244.80, reads: 29779.00, writes: 21739.21, response time: 300.63ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 1200, tps: 7200.58, reads: 29559.43, writes: 21599.74, response time: 306.26ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 1200, tps: 7439.96, reads: 30521.12, writes: 22318.47, response time: 302.53ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 1200, tps: 7540.64, reads: 30947.77, writes: 22622.12, response time: 296.96ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 1200, tps: 7531.32, reads: 30940.08, writes: 22595.57, response time: 297.50ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 1200, tps: 7529.58, reads: 30957.24, writes: 22589.35, response time: 297.59ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 1200, tps: 7537.04, reads: 30914.24, writes: 22609.41, response time: 297.32ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 1200, tps: 7550.28, reads: 31005.82, writes: 22651.24, response time: 296.52ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 1200, tps: 7277.91, reads: 29858.13, writes: 21833.73, response time: 317.37ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 1200, tps: 7164.67, reads: 29425.77, writes: 21494.30, response time: 318.80ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 1200, tps: 7774.73, reads: 31911.80, writes: 23321.48, response time: 288.47ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 1200, tps: 7798.52, reads: 32032.57, writes: 23397.35, response time: 287.69ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 1200, tps: 7911.78, reads: 32491.41, writes: 23741.54, response time: 283.67ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 1198, tps: 7940.21, reads: 32617.86, writes: 23815.54, response time: 282.40ms (95%), errors: 0.00, reconnects:  0.00
(last message repeated 91 times)
OLTP test statistics:
    queries performed:
        read:                            9401145
        write:                           6868749
        other:                           2289583
        total:                           18559477
    transactions:                        2289583 (7628.39 per sec.)
    read/write requests:                 16269894 (54207.75 per sec.)
    other operations:                    2289583 (7628.39 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.1397s
    total number of events:              2289583
    total time taken by event execution: 360075.3672s
    response time:
         min:                                  2.92ms
         avg:                                157.27ms
         max:                               8123.70ms
         approx.  95 percentile:             298.21ms

Threads fairness:
    events (avg/stddev):           1907.9858/43.37
    execution time (avg/stddev):   300.0628/0.04