raw/thread_scalability/sysbench-wt-ext4-wt2-pareto-5-oltp.txt
sysbench 0.9:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 5
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Threads started!

setting write concern to 1
[  10s] threads: 5, tps: 873.52, reads: 9598.16, writes: 2620.77, response time: 4.89ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 5, tps: 1430.40, reads: 15739.51, writes: 4291.20, response time: 4.28ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 5, tps: 1452.60, reads: 15950.10, writes: 4357.70, response time: 4.22ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 5, tps: 1474.60, reads: 16207.50, writes: 4423.70, response time: 4.14ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 5, tps: 1482.40, reads: 16325.22, writes: 4447.20, response time: 4.12ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 5, tps: 1484.90, reads: 16328.30, writes: 4454.70, response time: 4.12ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 5, tps: 1503.80, reads: 16557.29, writes: 4511.60, response time: 4.06ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 5, tps: 1521.20, reads: 16755.88, writes: 4563.40, response time: 4.03ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 5, tps: 1522.60, reads: 16732.82, writes: 4568.00, response time: 4.03ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 5, tps: 1523.30, reads: 16773.40, writes: 4569.70, response time: 4.01ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 5, tps: 1534.40, reads: 16895.20, writes: 4603.30, response time: 3.99ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 5, tps: 1519.60, reads: 16747.49, writes: 4558.70, response time: 4.03ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 5, tps: 1540.10, reads: 16927.50, writes: 4620.30, response time: 3.95ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 5, tps: 1542.10, reads: 16933.80, writes: 4626.30, response time: 3.96ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 5, tps: 1548.00, reads: 17029.90, writes: 4644.00, response time: 3.94ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 5, tps: 1547.80, reads: 17035.72, writes: 4643.61, response time: 3.93ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 5, tps: 1550.80, reads: 17038.28, writes: 4652.19, response time: 3.93ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 5, tps: 1553.40, reads: 17083.10, writes: 4660.20, response time: 3.92ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 5, tps: 1555.80, reads: 17104.70, writes: 4667.40, response time: 3.90ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 5, tps: 1549.20, reads: 17030.52, writes: 4647.81, response time: 3.94ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 5, tps: 1552.20, reads: 17037.08, writes: 4656.39, response time: 3.94ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 5, tps: 1564.10, reads: 17209.40, writes: 4692.30, response time: 3.86ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 5, tps: 1564.40, reads: 17204.60, writes: 4693.20, response time: 3.87ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 5, tps: 1556.80, reads: 17101.40, writes: 4670.50, response time: 3.89ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 5, tps: 1541.30, reads: 16960.19, writes: 4623.80, response time: 3.94ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 5, tps: 1561.90, reads: 17186.41, writes: 4685.70, response time: 3.87ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 5, tps: 1572.50, reads: 17308.19, writes: 4717.50, response time: 3.85ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 5, tps: 1571.30, reads: 17256.72, writes: 4714.01, response time: 3.87ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 5, tps: 1590.70, reads: 17465.38, writes: 4772.09, response time: 3.76ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 5, tps: 1628.90, reads: 17921.00, writes: 4886.60, response time: 3.49ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            4994457
        write:                           1362453
        other:                           454151
        total:                           6811061
    transactions:                        454151 (1513.82 per sec.)
    read/write requests:                 6356910 (21189.52 per sec.)
    other operations:                    454151 (1513.82 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0026s
    total number of events:              454151
    total time taken by event execution: 1499.5013s
    response time:
         min:                                  2.15ms
         avg:                                  3.30ms
         max:                                268.99ms
         approx.  95 percentile:               4.01ms

Threads fairness:
    events (avg/stddev):           90830.2000/2032.74
    execution time (avg/stddev):   299.9003/0.01